import java.util.Scanner;

public class Main {
    static final int MOD = 10_007;
    
    static int N;
    static int[][][][] dp;

    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        N = sc.nextInt();

        dp = new int[N + 2][2][2][2];
        dp[1][0][0][0] = 1;

        for(int i = 1; i <= N; i++) {
            // dp[i][0][0][0]에서 나올 수 있는 모양 전부 갱신
            dp[i + 1][0][0][1] = (dp[i + 1][0][0][1] + dp[i][0][0][0]) % MOD;
            dp[i + 1][1][0][0] = (dp[i + 1][1][0][0] + dp[i][0][0][0]) % MOD;
            dp[i + 1][1][1][1] = (dp[i + 1][1][1][1] + dp[i][0][0][0]) % MOD;

            // dp[i][0][0][1]에서 나올 수 있는 모양 전부 갱신
            dp[i + 1][0][0][0] = (dp[i + 1][0][0][0] + dp[i][0][0][1]) % MOD;
            dp[i + 1][1][1][0] = (dp[i + 1][1][1][0] + dp[i][0][0][1]) % MOD;

            // dp[i][0][1][0]에서 나올 수 있는 모양 전부 갱신
            dp[i + 1][1][0][1] = (dp[i + 1][1][0][1] + dp[i][0][1][0]) % MOD;

            // dp[i][1][0][0]에서 나올 수 있는 모양 전부 갱신
            dp[i + 1][0][0][0] = (dp[i + 1][0][0][0] + dp[i][1][0][0]) % MOD;
            dp[i + 1][0][1][1] = (dp[i + 1][0][1][1] + dp[i][1][0][0]) % MOD;

            // dp[i][0][1][1]에서 나올 수 있는 모양 전부 갱신
            dp[i + 1][1][0][0] = (dp[i + 1][1][0][0] + dp[i][0][1][1]) % MOD;

            // dp[i][1][0][1]에서 나올 수 있는 모양 전부 갱신
            dp[i + 1][0][1][0] = (dp[i + 1][0][1][0] + dp[i][1][0][1]) % MOD;

            // dp[i][1][1][0]에서 나올 수 있는 모양 전부 갱신
            dp[i + 1][0][0][1] = (dp[i + 1][0][0][1] + dp[i][1][1][0]) % MOD;

            // dp[i][1][1][1]에서 나올 수 있는 모양 전부 갱신
            dp[i + 1][0][0][0] = (dp[i + 1][0][0][0] + dp[i][1][1][1]) % MOD;
        }

        System.out.print(dp[N + 1][0][0][0]);
    }
}